src/Reports/ИзвещенияВВоенкоматы/ИзвещенияВВоенкоматы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИзвещенияВВоенкоматы</name>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраненныеНастройки</name>
  </attributes>
  <attributes>
    <name>ПостроительОтчета</name>
    <type>
      <types>ReportBuilder</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьЗаголовок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/РаботникиОрганизаций/РаботникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизаций</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ВоинскийУчет/ВоинскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВоинскийУчет</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ОтношениеКВоинскойОбязанности</name>
    <type>
      <types>EnumRef.ОтношениеКВоинскойОбязанности</types>
    </type>
  </resources>
  <resources>
    <name>ОтношениеКВоинскомуУчету</name>
    <type>
      <types>EnumRef.ОтношениеКВоинскомуУчету</types>
    </type>
  </resources>
  <resources>
    <name>Звание</name>
    <type>
      <types>CatalogRef.ВоинскиеЗвания</types>
    </type>
  </resources>
  <resources>
    <name>ВУС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Годность</name>
    <type>
      <types>EnumRef.ГодностьКВоеннойСлужбе</types>
    </type>
  </resources>
  <resources>
    <name>Военкомат</name>
    <type>
      <types>CatalogRef.Военкоматы</types>
    </type>
  </resources>
  <resources>
    <name>НаличиеМобпредписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗабронированОрганизацией</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ОснованиеНегодности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпецУчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Группа</name>
    <type>
      <types>EnumRef.ГруппыВоинскогоУчета</types>
    </type>
  </resources>
  <resources>
    <name>Категория</name>
    <type>
      <types>EnumRef.КатегорииВоинскогоУчета</types>
    </type>
  </resources>
  <resources>
    <name>Профиль</name>
    <type>
      <types>EnumRef.ПрофилиОфицеров</types>
    </type>
  </resources>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СемейноеПоложениеФизЛиц/СемейноеПоложениеФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СемейноеПоложениеФизЛиц</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СемейноеПоложение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СемейноеПоложениеФизЛиц</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ФИОФизЛиц/ФИОФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизЛиц</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ЛичныеКонтакты</types>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛицаОрганизаций</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственноеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Адрес</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/ПричиныИзмененияСостояния/ПричиныИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныИзмененияСостояния</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПриемНаРаботу</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/ОтношениеКВоинскойОбязанности/ОтношениеКВоинскойОбязанности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтношениеКВоинскойОбязанности</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Военнообязанный</name>
  </enumValues>
  <enumValues>
    <name>НеВоеннообязанный</name>
  </enumValues>
  <enumValues>
    <name>Призывник</name>
  </enumValues>
</mdclass:Enum>

src/Reports/ИзвещенияВВоенкоматы/ObjectModule.bsl
#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Настройка периода
Перем НП Экспорт;

Перем мНазваниеОтчета Экспорт; // название отчета

Перем мСтруктураДляОтбораПоКатегориям Экспорт; // содержит связь отборов текста запроса Построителя и значений категорий

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	мНазваниеОтчета = "Извещения в военкоматы о принятых и уволенных военнообязанных";
	
	// структура представлений полей
	СтруктураПредставлениеПолей = Новый Структура();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Призывники.Военкомат КАК Военкомат,
	|	Призывники.Физлицо,
	|	ВЫБОР КОГДА (ФИОФизЛиц.Фамилия) ЕСТЬ NULL  ТОГДА Призывники.Физлицо.Наименование ИНАЧЕ ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество КОНЕЦ КАК ФиоПолное,
	|	Призывники.ТекстЗвание,
	|	Призывники.Звание КАК Звание,
	|	ГОД(Призывники.Физлицо.ДатаРождения) КАК ГодРождения,
	|	ВЫБОР КОГДА Призывники.УровеньОбразования = 4 ТОГДА &ВысшееОбразование КОГДА Призывники.УровеньОбразования = 0 ТОГДА ""Другое образование"" ИНАЧЕ ФизическиеЛицаОбразование.ВидОбразования КОНЕЦ КАК Образование,
	|	СемейноеПоложениеФизЛиц.СемейноеПоложение КАК СемейноеПоложение,
	|	ФактическийАдрес.Представление КАК ФактическийАдрес,
	|	АдресПрописки.Представление КАК АдресПрописки,
	|	ДомашнийТелефон.Представление КАК ДомашнийТелефон,
	|	Призывники.Событие,
	|	Призывники.ДатаСобытия,
	|	Призывники.ДолжностьРаботника,
	|	Призывники.Организация КАК Организация,
	|	Призывники.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	|	АдресОрганизации.Представление КАК АдресОрганизации,
	|	ТелефонОрганизации.Представление КАК ТелефонОрганизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		Призывники.Физлицо КАК Физлицо,
	|		Призывники.Звание КАК Звание,
	|		Призывники.Военкомат КАК Военкомат,
	|		Призывники.ВУС КАК ВУС,
	|		Призывники.Организация КАК Организация,
	|		Призывники.ДатаСобытия КАК ДатаСобытия,
	|		МАКСИМУМ(ВЫБОР КОГДА ФизическиеЛицаОбразование.ВидОбразования В (&СписокВысшегоОбразования) ТОГДА 4 КОГДА ФизическиеЛицаОбразование.ВидОбразования = &СреднееПрофессиональноеОбразование ТОГДА 3 КОГДА ФизическиеЛицаОбразование.ВидОбразования = &НачальноеПрофессиональноеОбразование ТОГДА 2 КОГДА ФизическиеЛицаОбразование.ВидОбразования = &СреднееПолноеОбщееОбразование ТОГДА 1 КОГДА ФизическиеЛицаОбразование.ВидОбразования <> &ПустоеОбразование ТОГДА 1 ИНАЧЕ -(1) КОНЕЦ) КАК УровеньОбразования,
	|		Призывники.Событие КАК Событие,
	|		Призывники.ТекстЗвание КАК ТекстЗвание,
	|		Призывники.ДолжностьРаботника КАК ДолжностьРаботника
	|	ИЗ
	|		(ВЫБРАТЬ
	|			РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
	|			ВоинскийУчетСрезПоследних.Звание КАК Звание,
	|			ВоинскийУчетСрезПоследних.Военкомат КАК Военкомат,
	|			ВоинскийУчетСрезПоследних.ВУС КАК ВУС,
	|			РаботникиОрганизации.ПодразделениеОрганизации.Владелец КАК Организация,
	|			ВЫБОР
	|				КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Прием
	|					ТОГДА РаботникиОрганизации.Период
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(РаботникиОрганизации.Период, ДЕНЬ, -1)
	|			КОНЕЦ КАК ДатаСобытия,
	|			ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Прием ТОГДА ""Принят"" ИНАЧЕ ""Уволен"" КОНЕЦ КАК Событие,
	|			ВЫБОР КОГДА ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = &Призывник ТОГДА ""гражданин, подлежащий призыву на военную службу"" ИНАЧЕ ВоинскийУчетСрезПоследних.Звание.Наименование + "" запаса; ВУС № "" + ВоинскийУчетСрезПоследних.ВУС КОНЕЦ КАК ТекстЗвание,
	|			ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Прием ТОГДА ""на должность "" + РаботникиОрганизации.Должность.Наименование ИНАЧЕ """" КОНЕЦ КАК ДолжностьРаботника
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&ДатаКон, ) КАК ВоинскийУчетСрезПоследних
	|				ПО РаботникиОрганизации.Сотрудник.Физлицо = ВоинскийУчетСрезПоследних.Физлицо
	|		
	|		ГДЕ
	|			РаботникиОрганизации.Период МЕЖДУ &ДатаНач И &ДатаКон И
	|			РаботникиОрганизации.ПричинаИзмененияСостояния <> &Перемещение И
	|			ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности В(&Военнообязанные) И
	|			(РаботникиОрганизации.Сотрудник.ВидЗанятости <> &ВнутреннееСовместительство)
	|	
	|		{ГДЕ
	|	    	Организация, Военкомат, ПричинаИзмененияСостояния КАК Событие, РаботникиОрганизации.Сотрудник.Физлицо.*
	|		}
	|	    ) КАК Призывники
	|	
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Образование КАК ФизическиеЛицаОбразование
	|			ПО Призывники.Физлицо = ФизическиеЛицаОбразование.Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Призывники.Физлицо,
	|		Призывники.Звание,
	|		Призывники.Военкомат,
	|		Призывники.ВУС,
	|		Призывники.Организация,
	|		Призывники.ДатаСобытия,
	|		Призывники.Событие,
	|		Призывники.ТекстЗвание,
	|		Призывники.ДолжностьРаботника) КАК Призывники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних(&ДатаКон, ) КАК СемейноеПоложениеФизЛиц
	|		ПО Призывники.Физлицо = СемейноеПоложениеФизЛиц.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаКон, ) КАК ФИОФизЛиц
	|		ПО Призывники.Физлицо = ФИОФизЛиц.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ФактическийАдрес
	|		ПО Призывники.Физлицо = ФактическийАдрес.Объект И (ФактическийАдрес.Тип = &Адрес) И (ФактическийАдрес.Вид = &ФактическийАдрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресПрописки
	|		ПО Призывники.Физлицо = АдресПрописки.Объект И (АдресПрописки.Тип = &Адрес) И (АдресПрописки.Вид = &АдресПрописки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашнийТелефон
	|		ПО Призывники.Физлицо = ДомашнийТелефон.Объект И (ДомашнийТелефон.Тип = &Телефон) И (ДомашнийТелефон.Вид = &ДомашнийТелефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Образование КАК ФизическиеЛицаОбразование
	|		ПО Призывники.Физлицо = ФизическиеЛицаОбразование.Ссылка И (Призывники.УровеньОбразования = ВЫБОР КОГДА ФизическиеЛицаОбразование.ВидОбразования В (&ВысшееОбразование) ТОГДА 4 КОГДА ФизическиеЛицаОбразование.ВидОбразования = &СреднееПрофессиональноеОбразование ТОГДА 3 КОГДА ФизическиеЛицаОбразование.ВидОбразования = &НачальноеПрофессиональноеОбразование ТОГДА 2 КОГДА ФизическиеЛицаОбразование.ВидОбразования = &СреднееПолноеОбщееОбразование ТОГДА 1 ИНАЧЕ 0 КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресОрганизации
	|		ПО Призывники.Организация = АдресОрганизации.Объект И (АдресОрганизации.Тип = &Адрес) И (АдресОрганизации.Вид = &АдресОрганизации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонОрганизации
	|		ПО Призывники.Организация = ТелефонОрганизации.Объект И (ТелефонОрганизации.Тип = &Телефон) И (ТелефонОрганизации.Вид = &ТелефонОрганизации)
	|	
	|{УПОРЯДОЧИТЬ ПО
	|	Призывники.Военкомат, Организация, Событие, Физлицо.*
	|}
	|";	
	
	ПостроительОтчета.Текст = ТекстЗапроса;							  
							  
	// отборы по умолчанию
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Организация");
	МассивОтбора.Добавить("Военкомат");
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
КонецПроцедуры

Функция СформироватьЗаголовок(МакетОтчета)


	ЗаголовокОтчета = МакетОтчета.ПолучитьОбласть("Заголовок");

	// Вывод заголовка, описателя периода и фильтров и заголовка
	Если ДатаНач = '00010101000000' И ДатаКон = '00010101000000' Тогда
		ОписаниеПериода     = "Период не установлен";
	Иначе
		Если ДатаНач = '00010101000000' ИЛИ ДатаКон = '00010101000000' Тогда
			ОписаниеПериода = "" + Формат(ДатаНач, "ДФ = ""дд.ММ.гггг""; ДП = ""...""") 
			+ " - "      + Формат(ДатаКон, "ДФ = ""дд.ММ.гггг""; ДП = ""...""");
		Иначе
			Если ДатаНач <= ДатаКон Тогда
				ОписаниеПериода = "" + ПредставлениеПериода(НачалоДня(ДатаНач), КонецДня(ДатаКон), "ФП = Истина");
			Иначе
				ОписаниеПериода = "Неправильно задан период!"
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	СписокОтбор = "";
	Для Сч=0 По ПостроительОтчета.Отбор.Количество()-1 Цикл

		Если ПостроительОтчета.Отбор[Сч].Использование И Не ПостроительОтчета.Отбор[Сч].Имя = "Периодичность" Тогда

			СписокОтбор = СписокОтбор +", "+ ПостроительОтчета.Отбор[Сч].Представление 
			+" "+ ПостроительОтчета.Отбор[Сч].ВидСравнения +" "+ ПостроительОтчета.Отбор[Сч].Значение;

		КонецЕсли; 
	
	КонецЦикла; 

	ЗаголовокОтчета.Параметры.ЗаголовокОтчета = мНазваниеОтчета;
	ЗаголовокОтчета.Параметры.Период     = "Период: "+ОписаниеПериода;
	ЗаголовокОтчета.Параметры.Отбор      = "Отбор:"    +Сред(СписокОтбор,2);

	Возврат ЗаголовокОтчета;
КонецФункции // СформироватьЗаголовок()

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт
	
	ВысшееОбразование = Новый Массив;
	ВысшееОбразование.Добавить(Справочники.ВидыОбразованияФизЛиц.Аспирантура);
	ВысшееОбразование.Добавить(Справочники.ВидыОбразованияФизЛиц.АдъюнктураОрдинатура);
	ВысшееОбразование.Добавить(Справочники.ВидыОбразованияФизЛиц.ВысшееОбразование);
	ВысшееОбразование.Добавить(Справочники.ВидыОбразованияФизЛиц.Докторантура);
	
	ПостроительОтчета.Параметры.Вставить("СреднееПолноеОбщееОбразование", Справочники.ВидыОбразованияФизЛиц.СреднееПолноеОбщееОбразование);
	ПостроительОтчета.Параметры.Вставить("НачальноеПрофессиональноеОбразование", Справочники.ВидыОбразованияФизЛиц.НачальноеПрофессиональноеОбразование);
	ПостроительОтчета.Параметры.Вставить("СреднееПрофессиональноеОбразование", Справочники.ВидыОбразованияФизЛиц.СреднееПрофессиональноеОбразование);
	ПостроительОтчета.Параметры.Вставить("ВысшееОбразование", Справочники.ВидыОбразованияФизЛиц.ВысшееОбразование); 
	ПостроительОтчета.Параметры.Вставить("ПустоеОбразование", Справочники.ВидыОбразованияФизЛиц.ПустаяСсылка());
	ПостроительОтчета.Параметры.Вставить("СписокВысшегоОбразования", ВысшееОбразование);
	ПостроительОтчета.Параметры.Вставить("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПостроительОтчета.Параметры.Вставить("ФактическийАдрес", Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	ПостроительОтчета.Параметры.Вставить("АдресПрописки", Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	ПостроительОтчета.Параметры.Вставить("АдресОрганизации", Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	ПостроительОтчета.Параметры.Вставить("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПостроительОтчета.Параметры.Вставить("ДомашнийТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаДомашний);
	ПостроительОтчета.Параметры.Вставить("ТелефонОрганизации", Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	ПостроительОтчета.Параметры.Вставить("Перемещение", Перечисления.ПричиныИзмененияСостояния.Перемещение);
	ПостроительОтчета.Параметры.Вставить("Прием", Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	
	Военнообязанные = Новый Массив;
	Военнообязанные.Добавить(Перечисления.ОтношениеКВоинскойОбязанности.Призывник);
	Военнообязанные.Добавить(Перечисления.ОтношениеКВоинскойОбязанности.Военнообязанный);
	ПостроительОтчета.Параметры.Вставить("Военнообязанные", Военнообязанные);
	
	ПостроительОтчета.Параметры.Вставить("Призывник", Перечисления.ОтношениеКВоинскойОбязанности.Призывник);
	ПостроительОтчета.Параметры.Вставить("ВнутреннееСовместительство", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);

    // Проверка на пустые значения
	Если ПустаяСтрока(ПостроительОтчета.Текст) Тогда
		
		Предупреждение("Не определен запрос отчета!");
		
		ЕстьОшибки = Истина;
		Возврат;
	КонецЕсли;

	Если ДатаНач > ДатаКон И ДатаКон <> '00010101000000' Тогда
		Предупреждение("Дата начала периода не может быть больше даты конца периода", 60);
		ЕстьОшибки = Истина;
		Возврат;
	КонецЕсли;

	Если НЕ УправлениеОтчетами.ЗадатьПараметрыОтбораПоКатегориям(ПостроительОтчета, мСтруктураДляОтбораПоКатегориям) Тогда
		//повторные отборы по категориям
		Предупреждение("По одной категории нельзя устанавливать два отбора", 60);
		ЕстьОшибки = Истина;
		Возврат;
	КонецЕсли;

	УправлениеОтчетами.ПроверитьПорядокПостроителяОтчета(ПостроительОтчета);

	ПостроительОтчета.Параметры.Вставить("ДатаНач", ДатаНач);
	Если ДатаКон <> '00010101000000' Тогда
		ПостроительОтчета.Параметры.Вставить("ДатаКон", КонецДня(ДатаКон));
	Иначе
		ПостроительОтчета.Параметры.Вставить("ДатаКон", '00010101000000');
	КонецЕсли;

	МакетОтчета = ПолучитьМакет("Макет");
	ЗаголовокОтчета = СформироватьЗаголовок(МакетОтчета);
	// Параметр для показа заголовка
	ВысотаЗаголовка = ЗаголовокОтчета.ВысотаТаблицы;
	
	// Заголовок отчета
	ДокументРезультат.Очистить();
	ДокументРезультат.Вывести(ЗаголовокОтчета);

	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли; 

	// Исполнение запроса
	ПостроительОтчета.Выполнить();

	// Вывод в отчет
	ОбластьИзвещение = МакетОтчета.ПолучитьОбласть("Извещение");
	ОбластьИзвещение.Параметры.ТекстТекущейДаты = РабочаяДата;
	ОбластьЛинияОтреза = МакетОтчета.ПолучитьОбласть("ЛинияОтреза");	
	
	ФизЛицоОтветственного = Ответственный.ФизЛицо;
	Если ЗначениеЗаполнено(ФизЛицоОтветственного) Тогда
		
		Запрос = Новый Запрос();
		ТекстУсловий = "";
		Если ПостроительОтчета.Отбор.Организация.Использование Тогда
			ТекстУсловий = ", СтруктурнаяЕдиница = &Организация";
			Запрос.УстановитьПараметр("Организация",ПостроительОтчета.Отбор.Организация.Значение);
		КонецЕсли;
		
		ТекстЗапроса = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Наименование КАК ДолжностьОтветственного
			|ИЗ
			|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаКон" + ТекстУсловий + ") КАК ОтветственныеЛицаОрганизацийСрезПоследних
			|
			|ГДЕ
			|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";
							   
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ФизическоеЛицо",ФизЛицоОтветственного);
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
		    ОбластьИзвещение.Параметры.Заполнить(Выборка);
		КонецЕсли;
	КонецЕсли;
	
	// вывод самих извещений
	Выборка = ПостроительОтчета.Результат.Выбрать();
	Если Выборка.Количество() > 0 Тогда
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	НечетнаяСекция = Истина;
	Пока Выборка.Следующий() Цикл
	    ОбластьИзвещение.Параметры.Заполнить(Выборка);
		ДокументРезультат.Вывести(ОбластьИзвещение);
	    Если НечетнаяСекция Тогда
			ДокументРезультат.Вывести(ОбластьЛинияОтреза);
		Иначе 
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НечетнаяСекция = Не НечетнаяСекция;
	КонецЦикла;
	
	// Управление заголовком
	Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область(1,,ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;

	// Первую колонку не печатаем
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);

	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = "ИзвещенияВВоенкоматы";

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП = Новый НастройкаПериода;

ПоказыватьЗаголовок = Истина;

#КонецЕсли
